Repository: kauamiguel/MindMathApp
Catalog: aplicativoMacroChallenged/*.lproj/Localizable.strings
Languages: pt_br

source: Remember that the sum of all interior angles is 180 degrees. If in doubt, go back to the theory page.
pt_br: Lembre-se que a soma de todos os ângulos internos é 180 graus. Em caso de dúvida, volte para a página de teoria.

source: The value you found of 7.2° was the same as Erastothenes arrived at, and with that he could prove that the earth had a radius of approximately 40,000 KM, but that is a subject for the next module...
pt_br: O valor que você achou de 7,2° foi o mesmo que Erastótenes chegou, e com isso ele pode provar que a terra tinha um raio de aproximadamente 40.000 KM, mas isso é assunto para o próximo módulo...

source: Assuming that the blue-painted angles of the triangle above both measure 86.4 degrees, what is the value of the green angle?
pt_br: Supondo que os ângulos pintados de azul do triângulo acima tem ambos medida de 86.4 graus, qual o valor do ângulo de verde?

source: Why 180 degrees?
pt_br: Por que 180 graus?

source: Angles in Triangle
pt_br: Ângulos no triangulo

source: Let's take this pretty triangle as a base.
pt_br: Vamos pegar esse bonito triângulo como base.

source: Regardless of the way, we can divide the triangle into 3 parts, as long as the angles remain intact...
pt_br: Independente da maneira, podemos partir o triângulo em 3 partes , contando que os ângulos fiquem intactos...

source: If we add the angles side by side, we can see that they form half of a circle, which is 180 degrees.
pt_br: Se juntarmos os ângulos uns do lado dos outros, podemos perceber que eles formam metade de uma circunferência, que é 180 graus.

source: A fellow named Eratosthenes of ancient Greece noticed that when the light was exactly on top of a wooden stake, it cast no shadow...
pt_br: Um camarada chamado Eratóstenes da Grécia antiga percebeu que quando a luz estava exatamente em cima de uma estaca de madeira, ele não produzia sombra...

source: With the most advanced locomotion tools of the time (On foot), Erastóthenes went to check if the same phenomenon happened at the same time in another city, and he realized that the stakes were in shadow, which implies the curvature of the earth. 🤯 Let's see that, just using knowledge about angles in a triangle, a sage from 250 BC was able to reach extremely profound conclusions, and without the use of google.
pt_br: Com as ferramentas de locomoção mais avançadas da época (A pé), Erastótenes foi verificar se no mesmo horário em outra cidade acontecia o mesmo fenômeno, e ele percebeu que as estacas ficavam com sombra, o que implica a curvatura da terra. 🤯 Vejamos que, apenas usando conhecimento sobre ângulos em um triângulo, um sábio de 250 A.C conseguiu chegar a conclusões extremamente profundas, e sem o uso do google.

source: Back
pt_br: Voltar

source: Continue
pt_br: Continuar

source: Exercise
pt_br: Exercício

source: What's aplication?
pt_br: Qual a aplicação?

source: Got it !
pt_br: Captei !

source: Back to menu
pt_br: Voltar para o menu

source: Tips
pt_br: Dicas

source: CONGRATULATIONS!
pt_br: PARABÉNS!

source: You understood the principles
pt_br: Você entendeu os princípios.

source: Close
pt_br: Fechar

source: Remember that the knight moves in an L, and therefore moves 3 squares. Draw the possible moves he can make to reach the path. If in doubt, go back to the theory page.
pt_br: Lembre que o cavalo faz o movimento em L, e portanto, anda 3 casas. Desnhe os possíveis movimentos que ele pode fazer para chegar no caminho. Caso sinta dúvida, volte na página de teoria.

source: The knight always moves 3 spaces, so the number of spaces he moves is always a multiple of 3.
pt_br: O cavalo sempre anda 3 casa, logo o número de casa que ele anda é sempre um múltiplo de 3.

source: What is the minimum number of squares the horse will need to walk given its standard movement to reach the marked area?
pt_br: Qual o número mínimo de quadrados o cavalo precisará andar dado o seu movimento padrão para chegar na área marcada?

source: What are rectangles?
pt_br: O que são retângulos?

source: Rectangles
pt_br: Retângulos

source: A rectangle is a geometric figure with four equal sides and four equal angles. The bottom sides are called the base and the side the height.
pt_br: Um retângulo é uma figura geométrica com quatro lados e quatro ângulos iguais. Os lados da parte de baixo são chamados de base e o da parte lateral de altura.

source: Using the above definition, we can conclude that a square is a type of rectangle.
pt_br: Usando a definição acima, podemos concluir que um quadrado é um tipo de retângulo.

source: One important property we can exploit is the perimeter, which we define as the sum of all sides. In the case above, 2 times the green side + 2 times the orange side.
pt_br: Uma propriedade importante que podemos explorar é o perímetro, que definimos como a soma de todos os lados. No caso acima, 2 vezes o lado verde + 2 vezes o lado laranja.

source: Chess is a board game that uses logical reasoning and geometry. The board is composed of squares of the same size interspersed between black and white
pt_br: O xadrez é um jogo de tabuleiro que utiliza do raciocínio lógico e geometria. O tabuleiro é composto por quadrados de mesmo tamanho intercalados entre preto e branco

source: The knight always moves in an L, that is, two squares (horizontal and vertical) and the next square that makes a right angle. Another curiosity is that the knight always ends up in a square with the opposite color to the initial one.
pt_br: O cavalo sempre faz movimentos em L, ou seja, duas casa (horizontais e verticais) e a próxima casa que faz um ângulo reto. Outra curiosidade é que o cavalo sempre termina em uma casa com a cor oposta a inicial.

source: The area of ​​any rectangle is base x height, so you need to find out how much the base and height are worth, which the figure tells you in a non-direct way. If in doubt, go back to the theory page.
pt_br: A área de qualquer retângulo é base x altura, logo você precisa descobrir qauanto vale a base e a altura, o que a figura informa de uma maneira não direta. Caso sinta dúvida, volte na página de teoria.

source: Always when calculating an area, we must add all the horizontal parts and all the vertical parts, so we can multiply the base by the height.
pt_br: Sempre ao calcular uma área, devemos somar todas as partes horizontais e todas as partes verticais, assim podemos multiplicar a base pela altura.

source: What is the area of ​​the figure above?
pt_br: Qual a área da figura acima?

source: What is area?
pt_br: O que é área?

source: Areas
pt_br: Áreas

source: Assuming the green square above has 1 unit...
pt_br: Supondo que o quadrado verde acima tenha 1 unidade...

source: Area can be defined as the space within a figure in two dimensions.
pt_br: A área pode ser definida como o espaço dentro de uma figura em duas dimensões.

source: So the area of ​​the larger rectangle equals 4 squares.
pt_br: Logo, a área do retângulo maior equivale a 4 quadrados.

source: Now imagine several smaller squares inside our rectangle, the area will be the sum of all of them. But how can we generalize this? Realize that a way to account for the number of squares can be by multiplying the squares horizontally and multiplying by the of the vertical. So the area of ​​a rectangle can be defined as base*height.
pt_br: Agora imagine vários quadrados menores dentro do nosso retângulo, a área será a soma de todos eles. Mas como podemos generalizar isso? Perceba que uma maneira de contabilizar a quantidade de quadrados pode ser multiplicando os quadrados na horizontal e multiplicar por os da vertical. Logo a área de um retângulo pode ser definida como base*altura.

source: Football fields can be seen as two-dimensional figures, and therefore you can calculate the area. The GPS on the players' vest uses the measurements of the field and the GPS distance to calculate how many KM the player has run.
pt_br: Os campos de futebol podem ser visto como figuras bidimensionais, e portando pode calcular a área. O GPS no colete dos jogadores utiliza-se das medidas do campo e a distância do gps para calcular quantos KM o jogador correu.

source: The circumference has 360 degrees and its half 180, so you need to find the half of half a circle. If you feel in doubt, go back to the theory page.
pt_br: A circunferência tem 360 graus e sua metade 180, logo você precisa achar a metade de meia circunferência. Caso sinta dúvida, volte na página de teoria.

source: Given that the circumference is 360°, half is 180° and half of that is 90°.
pt_br: Dado que a circunferência tem 360°, metade é 180° e metade disso é 90°.

source: Given the properties of the circle, what is the angle above?
pt_br: Dado as propriedades da circunferência, quanto vale o ângulo acima?

source: What is circumference?
pt_br: O que é circunferência?

source: Circumference
pt_br: Circunfêrencia

source: A circle is a figure where all points have the same distance from a common point.
pt_br: Circunferência é uma figura onde todos os pontos tem a mesma distância de um ponto em comum.

source: What do you mean? All points on the circle have the same distance from the central point, as shown in the image above
pt_br: Como assim? Todos os pontos da circunferência tem a mesma distância do ponto central, como mostra a imagem acima

source: An important property of circumference is that it has 360°. Which allows us to reach the conclusion that half a circle has 180°, which is half of 360°.
pt_br: Uma propriedade importante da circunferência é que ela tem 360°. O que nos permite chegar a conclusão de que meia circunferência tem 180°, que é a metade de 360°.

source: The hard drives of current computers are divided into several circles called tracks, where the mechanical arm of the disk searches for the track to store or retrieve a value that is stored. This arm uses some calculations on the circumference to find the search track .
pt_br: Os disco rígidos dos computadores atuais são divididos em diversos círculos chamados de trilhas, onde o braço mecânico do disco busca a trilha para armazenar ou pegar um valor que está armazenado. Tal braço utiliza de alguns cálculos sobre a circunferência para achar a trilha de busca.

source: Triangle wizard
pt_br: Mágico do triângulo

source: Chess boy
pt_br: Garoto Xadrez

source: Area specialist
pt_br: Especialista em área

source: Rounded magic
pt_br: Circulante

source: Triangles Wizard is a trophy that can only be earned by completing the Triangles module. Learning about it is of paramount importance, as your knowledge applies in many areas of the real world.
pt_br: Mago dos triângulos é um troféu que ganha apenas se completar o módulo de triângulos. Aprender sobre isso é de suma importância, já que seu conhecimento se aplica em diversas áreas do mundo real.

source: Chess Boy is a trophy that you can only win if you complete the rectangles module. Rectangle are in several areas of our lives, such as in buildings, in board games, in everyday calculations and etc. Learning these concepts will make you have a different worldview.
pt_br: Garoto do xadrez é um troféu que ganha apenas se completar o módulo de retângulos. Retângulo estão em diversas áreas das nossas vidas, como em construções, em jogos de tabuleiros, em cálculos cotidianos e etc. Aprender esses conceitos vão fazer você ter uma visão de mundo diferente.

source: Trophy area
pt_br: Área de troféus

source: In this graph there is a statistic related to the number of errors in each module, so the lower the value of the bar, the more efficient you were in the module.
pt_br: Nesse gráfico existe uma estatística relacionada ao número de erros em cada módulo, então quanto menor o valor da barra, mais eficiente você foi no módulo.

source: Chart Area
pt_br: Área de gráficos
